学习小贴士:

     曾经有一些看我博客的读者问我学习ios语言的最佳方式.这里有一些我分享到我的博客上的学习贴士,我希望这些贴士也对你们有用.



    1.保持你的手是脏的(多动手).我曾经在我写第一本书的最开始强调过这个技巧.你不能只靠读来学习编程.你需要动手来写一些代码. 你可以把swift当个游戏然后跟随前面的一些章节来创建你的第一个app.在你翻到下一章之前,尽你的最大努力来理解"Hello World"app是怎么运行的.如果你能掌握好这个基础,将会让你更容易的理解其他的原理.



    2.当你学习编程的时候,bugs将是你的朋友.时不时的,你会碰到bugs或者errors.你可能会写信给我然后说书上的例子不能运行啦.我是怎么修复bug的?我欢迎你们提问,我喜欢帮助你们学习编程.但是,我希望你们先去尝试自己解决问题.比如你们可以反复检查代码,或者在网上查找资料(尤其是stackoverflow.com).总之,在你提问之前尽你最大的努力来解决这些问题.和每个程序员一样,我厌恶bugs,尤其是在一个项目快要到截止期的时候.但是不管怎样,bugs一直在帮助我提高我的编程技术.如果你没有任何编程经验,一个对你有帮助的提示是Swift是一门有大小写的语言,这意味着"massage"和"Massage"是不同的.这是一个最常犯的错误和经常被问到的问题.



    3.俗话说:"最好的学习方法是教学".这句话同样适用于现代世界.你不一定非要是个专家才能教学.注意,这里我不是在谈论在大学演讲或者是在一个正规的班级教授一群学生.教学不一定非得在那样的场景下才能进行.它可以在很简单的环境下进行,比如和你身边的同事或者同学分享你的知识.当你学到一些新东西,尝试跟别人解释一下它的原理.比如说,在创建"HelloWorld"app之后,教给你身边的朋友,然后他们也可以做一个app.当你的编程语言和原理学得更多的时候,你可以组建一个兴趣小组,然后把你学到的分享给一大群人.

    这是我学了这么多以后总结的关于学习的一个最有用的方法,然后我在appcoda.com上发布了学习教程,再然后,出版了我的第一本书.

    有时候你会觉得你已经很了解这些原理了,但是当你需要解释一个概念给别人或者回答一问题的时候,你会发现你完全不了解这些原理.这会让你更努力的学习原理.当你学ios编程的时候我建议你试试这个方法.



    4.成为一个伟大的程序员是需要花时间的,有耐心一点.这本书的原理并不魔幻.你将学习ios编程最基础的东西和学会怎样制作属于你自己的apps.不要对你的第一个app期望太高,做一个简单而有趣的app就好了.



    5.我知道钱很重要.一些人开始学习app开发仅仅是为了钱.这没有错.你可能想做一个商业app来赚一些零花钱然后把它彻底的变成专职的商业项目.这是完全可以理解的.谁不想过富裕的生活呢?但是,如果钱是你做apps的主要理由,一旦你碰到bugs或者errors你将会很容易气馁,然后你会放弃.编程是一种挑战.我发现那些成功掌握编程语言的人是那种有强烈的欲望来做apps的,他们同样对学习编程非常狂热.一旦他们在脑海里有什么想法,他们就会像把他变成一个真的app.赚钱不是他们最关心的事.他们知道这个app能解决他们自己的问题,同样对别人也会有帮助.带着脑海中这样强烈的目的,他们能迎难而上.所以再想一遍你为什么要学习编程.
